# utilities
brew "bat"
brew "b3sum"
brew "curl"
brew "jq"
brew "ripgrep"
brew "tokei"
brew "tree"
brew "watchexec"
brew "wget"
brew "yq"
brew "bench"
brew "fzf"
brew "xsv"
brew "fd"
brew "difftastic"
brew "hurl"
cask "signal"
cask "numi"

# searching documents
%w[rga pandoc poppler tesseract tesseract-lang ffmpeg].each do |package|
  brew package
end

# shell
brew "starship"
brew "tmux"
brew "zsh"

# security
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"

# development
brew "gist"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "graphviz"
brew "imagemagick"
brew "neovim"
brew "hub"
brew "zola"
brew "asdf"
brew "universal-ctags"
brew "shellcheck"
brew "overmind"
brew "lazydocker"
cask "chromedriver"
cask "ngrok"
cask "kitty"
cask "postico"
cask "keycastr"

brew "heroku"

tap "unused-code/formulae"
brew "unused-code/formulae/unused"

cask "font-cascadia-code-pl"

# databases
brew "postgresql"
brew "sqlite"
brew "redis"

cask "daisydisk"
cask "orbstack"
cask "cleanmymac"
cask "tailscale"
