tap "homebrew/cask"

# utilities
brew "bat"
brew "b3sum"
brew "curl"
brew "jq"
brew "ripgrep"
brew "the_silver_searcher"
brew "tokei"
brew "tree"
brew "watchexec"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "bench"
brew "fzf"
brew "xsv"
brew "fd"
cask "signal"
cask "numi"

# shell
brew "reattach-to-user-namespace"
brew "starship"
brew "tmux"
brew "zsh"

# security
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"

# development
brew "gist"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "graphviz"
brew "imagemagick"
brew "neovim"
brew "hub"
brew "zola"
brew "asdf"
tap "universal-ctags/universal-ctags"
brew "universal-ctags", args: ["HEAD"]
cask "chromedriver"
cask "ngrok"
cask "kitty"
cask "postico"
cask "rowanj-gitx"

tap "heroku/brew"
brew "heroku"

tap "thoughtbot/formulae"
brew "parity"
brew "complexity"

tap "unused-code/formulae"
brew "unused-code/formulae/unused"

tap "homebrew/cask-fonts"
cask "font-cascadia-code-pl"
cask "font-jetbrains-mono-pl"

# databases
brew "postgresql"
brew "sqlite"
brew "redis"
